name: "ppseg_onnx"
platform: "onnxruntime_onnx"
max_batch_size : 0
input [
  {
    name: "x"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [ 3, 224, 398 ]
    reshape { shape: [ 1, 3, 224, 398 ] }
  }
]
output [
  {
    name: "save_infer_model/scale_0.tmp_1"
    data_type: TYPE_FP32
    dims: [ -1, 2, -1, -1  ]
    
  }
]